---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.#ctor(Autodesk.Revit.DB.ExtensibleStorage.Field,Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder)
source: html/933ec291-d085-aed9-8a97-ddd5156d74e2.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.#ctor Method

Constructs a new FieldBuilder using the field and associated SchemaBuilder object.

## Syntax (C#)
```csharp
public FieldBuilder(
	Field field,
	SchemaBuilder builder
)
```

## Parameters
- **field** (`Autodesk.Revit.DB.ExtensibleStorage.Field`)
- **builder** (`Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null